{
  "Otázka č. 19": {
    "Funkcie_a_význam_výchovno-vzdelávacích_disciplín": {
      "Aké sú hlavné funkcie pedagogiky?": "Teoretická – skúma, čo je výchova a ako funguje; Prognostická – predvída, aké budú potreby v budúcnosti; Propedeutická – zhŕňa poznatky pre prax.",
      "Aký je význam výchovy pre spoločnosť?": "Pomáha udržať kultúru a zvyky; pripravuje jednotlivcov na život medzi ľuďmi.",
      "Aký je prínos vzdelávania?": "Zvyšuje vedomosti a schopnosti; posúva spoločnosť vpred.",
      "Aké funkcie má didaktika?": "Diagnostická – zisťuje, ako prebieha vyučovanie; Prognostická – predpovedá zmeny vo vyučovaní; Inštrumentálna – navrhuje postupy; Normatívna – nastavuje pravidlá hodnotenia.",
      "K čomu slúži metodika vyučovania?": "Usporiadava a hodnotí metódy vyučovania; pomáha ich zlepšovať.",
      "Aké funkcie má vyučovací proces?": "Vzdelávacia – poskytuje vedomosti a zručnosti; Výchovná – formuje postoje a hodnoty; Rozvíjajúca – pomáha osobnostnému rastu."
    },

    "Učiteľstvo_ako_povolanie": {
      "Aký je profesijný a hodnotový rozmer učiteľstva?": "Učiteľ odovzdáva kultúrne dedičstvo a pripravuje žiakov na život.",
      "Prečo je potrebné celoživotné učenie učiteľa?": "Pretože učiteľ musí neustále zlepšovať svoje vedomosti, zručnosti a prístup.",
      "Aké je poslanie a zodpovednosť učiteľa?": "Učiteľ vedie žiakov, pomáha im rásť a pracuje z lásky k učeniu a ľuďom."
    },

    "Typy_vyučovacieho_procesu": {
      "Čo charakterizuje dogmatický typ vyučovania?": "Učiteľ len povie poučky; žiak si ich musí zapamätať bez vysvetlenia.",
      "Čo je výkladovo-ilustratívny (transmisívny) typ vyučovania?": "Učiteľ vysvetľuje, žiak počúva a opakuje; málo samostatnosti.",
      "Ako vyzerá moderný (konštruktivistický) typ vyučovania?": "Žiak poznatky objavuje sám; učiteľ ho len usmerňuje."
    },

    "Humanizácia_vyučovacieho_procesu": {
      "Ako sa humanizuje vyučovací proces?": "Podporuje sa dôvera, tvorivosť, samostatnosť, tolerancia a dobré vzťahy medzi učiteľom, žiakom a rodičom."
    },

    "Teória vzdelávania (didaktika)": {
      "Čo je didaktika?": "Je to veda o učení a vyučovaní.",
      "Čím sa zaoberá didaktika?": "Skúma, ako prebieha vyučovanie vrátane učiteľa, žiaka a prostredia.",
      "Čo je vyučovanie alebo výučba?": "Činnosti, ktoré učiteľ robí so žiakmi počas výuky.",
      "Čo je vyučovací proces?": "Situácia, keď učiteľ cielene učí žiakov.",
      "Čo je učenie?": "Učiteľ cielene pôsobí na žiaka, aby sa niečo naučil.",
      "Čo je vzdelávanie?": "Získavanie vedomostí a schopností od učiteľa.",
      "Čo je učenie sa?": "Proces, keď sa žiak učí a rozvíja svoje schopnosti."
    },

    "Druhy didaktík": {
      "Aké sú druhy didaktík podľa obsahu?": "Všeobecná didaktika – rieši všeobecné otázky vyučovania; Odborová didaktika – venuje sa príbuzným predmetom; Predmetová (metodika) – zameraná na konkrétny predmet.",
      "Aké sú príklady odborovej didaktiky?": "Didaktika hudby; Didaktika hry na sláčikové nástroje.",
      "Aké sú príklady predmetovej didaktiky?": "Metodika hry na lesnom rohu; Metodika teórie hudby; Metodika dirigovania.",
      "Aké sú druhy didaktík podľa stupňa školy?": "Predškolská didaktika; Didaktika základnej školy; Didaktika strednej školy; Didaktika vysokej školy.",
      "Aké sú druhy didaktík podľa typu školy?": "Didaktika základnej umeleckej školy; Didaktika konzervatória; Didaktika vysokej školy múzických umení."
    },

    "Súčasti a systém didaktiky": {
      "Čo sú ciele v didaktike?": "Stav, ktorý chceme učením dosiahnuť.",
      "Čo je učivo?": "Poznatky a činnosti, ktoré si žiaci osvojujú.",
      "Aké sú nástroje vyučovacieho procesu?": "Metódy; formy organizácie; komunikácia; pomôcky; technika; hodnotenie.",
      "Čo sú didaktické zásady?": "Pravidlá, ako má vyučovanie prebiehať.",
      "Aké sú vonkajšie podmienky vyučovania?": "Podmienky mimo žiaka – napr. prostredie, región, doba.",
      "Aké sú vnútorné podmienky vyučovania?": "Vlastnosti a schopnosti žiaka aj učiteľa – fyzický a psychický stav, vedomosti."
    },

    "Klasifikácia teórií v didaktike": {
      "Aké problémy sú v klasifikácii didaktických teórií?": "Rôzne prístupy opisujú rovnaké veci inak alebo sa líšia v pohľade; niekedy sa dopĺňajú alebo spájajú.",
      "Čo je makrodidaktická teória?": "Rieši, čo a kedy sa má učiť – teda plánovanie obsahu.",
      "Čo je mikrodidaktická teória?": "Rieši, ako najlepšie učiť konkrétny obsah."
    },

    "Teórie učenia vs. teórie učenia sa": {
      "Aký je rozdiel medzi teóriami učenia a učenia sa?": "Teórie učenia – ako má učiť učiteľ; Teórie učenia sa – ako sa učí žiak.",
      "Z čoho vychádzajú čiastkové teórie učenia?": "Z poznatkov psychológie, hlavne kognitívnej.",
      "Aké typy majú oba druhy teórií?": "Biologické – učenie pokus-omyl; Kultúrne a psychologické – učenie cez prax; Technické – dôraz na metódy učenia."
    },

    "Transmisia vs. konštruktivizmus v didaktike hudby": {
      "Čo je transmisia vo vyučovaní?": "Učiteľ vysvetľuje, žiak počúva; možná je aj diskusia.",
      "Čo je konštruktivizmus vo vyučovaní?": "Žiak získava poznatky sám cez skúsenosti; učiteľ ho usmerňuje.",
      "Ako sa uplatňuje konštruktivizmus v hudobnej výchove?": "Používa sa len v niektorých fázach výuky a predmetoch, nie všade."
    },

    "Pedagogické dokumenty": {
      "Čo sú pedagogické dokumenty?": "Dokumenty, ktoré určujú, ako škola a učitelia fungujú.",
      "Aké sú hlavné typy pedagogických dokumentov?": "Zákony; nariadenia; vzdelávacie programy; učebné plány a osnovy; štandardy; plány učiva; prípravy; učebnice; školské poriadky; triedne knihy; výkazy; katalógy; protokoly; rozvrhy; plány školy; žiacke knižky; vysvedčenia."
    }
  }
}
